titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [3]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
import pandas as pd
import numpy as np

titanic = pd.read_csv("train.csv")
display(titanic.head())
titanic.shape

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

(891, 12)

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [4]:
mean_of_death_age = titanic[titanic.Survived == 0].Age.mean()
print("Kazada ölenlerin yaş ortalaması: %.1f" % mean_of_death_age)

Kazada ölenlerin yaş ortalaması: 30.6

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [5]:
mean_of_fare = titanic[titanic["Survived"] == 0].Fare.mean()
median_of_fare = titanic[titanic.Survived == 0]["Fare"].median()

print("Kazada ölenlerin bilet fiyatlarının ortalaması: %.1f" % mean_of_fare)
print("Kazada ölenlerin bilet fiyatlarının medyanı: %.1f" % median_of_fare)

Kazada ölenlerin bilet fiyatlarının ortalaması: 22.1
Kazada ölenlerin bilet fiyatlarının medyanı: 10.5

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [6]:
dead_and_male = np.logical_and(titanic["Survived"] == 0, titanic["Sex"] == "male")
dead_male_mean = titanic[dead_and_male]["Age"].mean()

print("Kazada ölen erkeklerin yaş ortalaması: %.1f" % dead_male_mean)

Kazada ölen erkeklerin yaş ortalaması: 31.6

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [7]:
dead_and_female = np.logical_and(titanic["Survived"] == 0, titanic["Sex"] == "female")
dead_female_mean = titanic[dead_and_female]["Age"].mean()

print("Kazada ölen kadınların yaş ortalaması: %.2f" % dead_female_mean)

Kazada ölen kadınların yaş ortalaması: 25.05

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [8]:
query = titanic[titanic["Survived"] == 1].Age.mean()
print("Kazadan kurtulanların yaş ortalaması: %.1f" % query)

Kazadan kurtulanların yaş ortalaması: 28.3

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [9]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
query = titanic[titanic.Survived == 1].Fare.mean()
print("Kazadan kurtulanların bilet fiyatlarının ortalaması: %.4f" % query)

Kazadan kurtulanların bilet fiyatlarının ortalaması: 48.3954

Kazadan kurtulan toplam kişi sayısını bulunuz

In [10]:
query = len(titanic[titanic["Survived"] == 1])

print("Kazadan kurtulan toplam kişi sayısı: ",query)

Kazadan kurtulan toplam kişi sayısı:  342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [11]:
alive_and_male = titanic[(titanic["Survived"] == 1) & (titanic["Sex"] == "male")]
alive_male_mean = titanic[dead_and_male]["Age"].mean()

# or titanic[(titanic["Survived"] == 1) & (titanic["Sex"] == "male")]["Age"].mean()

print("Kazadan kurtulan erkeklerin yaş ortalaması: %.1f" % alive_male_mean)

Kazadan kurtulan erkeklerin yaş ortalaması: 31.6

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [12]:
query = titanic.query("Survived == 1 and Sex == 'female'")["Age"].mean()
# query = titanic[(titanic["Survived"] == 1) & (titanic["Sex"] == "female")]["Age"].mean()

print("Kazadan kurtulan kadınların yaş ortalaması: %.1f" % query)

Kazadan kurtulan kadınların yaş ortalaması: 28.8

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [13]:
# query = titanic.query("Age < 10")["Fare"].median()
query = titanic[titanic["Age"]<10]["Fare"].median()

print("10 yaşından küçüklerin bilet fiyatlarının medyan değeri: ", query)

10 yaşından küçüklerin bilet fiyatlarının medyan değeri:  27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [14]:
query = titanic.query("Age > 10")["Fare"].median()
#query = titanic[(titanic["Age"] > 10)]["Fare"].median()

print("10 yaşından büyüklerin bilet fiyatlarının medyan değeri: ", query)

10 yaşından büyüklerin bilet fiyatlarının medyan değeri:  13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [15]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
class1_death_ratio = 100*len(titanic[(titanic["Pclass"] == 1) & (titanic["Survived"] == 0)])/len(titanic)
class2_death_ratio = 100*len(titanic[(titanic["Pclass"] == 2) & (titanic["Survived"] == 0)])/len(titanic)
class3_death_ratio = 100*len(titanic[(titanic["Pclass"] == 3) & (titanic["Survived"] == 0)])/len(titanic)

print("1.sınıf yolcularının ölüm oranı yüzde %.2f" % class1_death_ratio)
print("2.sınıf yolcularının ölüm oranı yüzde %.2f" % class2_death_ratio)
print("3.sınıf yolcularının ölüm oranı yüzde %.2f" % class3_death_ratio)
print("--------------------------------")
print("Buradan, 3.sınıfta yolculuk edenlerin neredeyse yarısının ölmüş olduğunu görüyoruz.\n"+
     "Filmden de hatırladığım kadarıyla, 3.sınıf geminin en altında yer alan ve makine dairesine \n"+
     "en yakın kısımdı. Gemi tabandan su aldığı için haliyle kurtulmaları çok zor oldu.")

1.sınıf yolcularının ölüm oranı yüzde 8.98
2.sınıf yolcularının ölüm oranı yüzde 10.89
3.sınıf yolcularının ölüm oranı yüzde 41.75
--------------------------------
Buradan, 3.sınıfta yolculuk edenlerin neredeyse yarısının ölmüş olduğunu görüyoruz.
Filmden de hatırladığım kadarıyla, 3.sınıf geminin en altında yer alan ve makine dairesine
en yakın kısımdı. Gemi tabandan su aldığı için haliyle kurtulmaları çok zor oldu.

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [98]:
titanic.groupby("Pclass")["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [16]:
death_ratio_female = 100*(len(titanic[(titanic["Sex"] == "female") & (titanic["Survived"] == 0)])/len(titanic))
death_ratio_male = 100*(len(titanic[(titanic["Sex"] == "male") & (titanic["Survived"] == 0)])/len(titanic))

print("Ölen kadınların oranı : %.2f" % death_ratio_female)
print("Ölen erkeklerin oranı : %.2f" % death_ratio_male)

Ölen kadınların oranı : 9.09
Ölen erkeklerin oranı : 52.53

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya birkaç cümle ile sonucu <b>yorumlayınız.</b>

In [17]:
death_male_price = titanic[(titanic["Survived"] == 0) & (titanic["Sex"] == "male")]["Fare"].mean()
alive_male_price = titanic[(titanic["Sex"] == "male") & (titanic["Survived"] == 1)]["Fare"].mean()

print("Ölen erkeklerin bilet fiyat ortalaması     : %.4f" % death_male_price)
print("Kurtulan erkeklerin bilet fiyat ortalaması : %.4f" % alive_male_price)
print("--------------------")
print("Bu bilgi bize aslında daha ucuza yolculuk edenlerin yani daha düşük sınıfta olanların "+
     "öldüğünü gösteriyor")

Ölen erkeklerin bilet fiyat ortalaması     : 21.9610
Kurtulan erkeklerin bilet fiyat ortalaması : 40.8215
--------------------
Bu bilgi bize aslında daha ucuza yolculuk edenlerin yani daha düşük sınıfta olanların öldüğünü gösteriyor

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [18]:
# Age değişkenini SimpleImputer yardımı ile dolduruyorum
from sklearn.impute import SimpleImputer
df_titanic = pd.read_csv("train_missing.csv")

imp = SimpleImputer(strategy="mean")
imp.fit(df_titanic[["Age","Fare"]])

df_titanic[["Age","Fare"]] = imp.transform(df_titanic[["Age","Fare"]])

df_titanic[["Age","Fare"]].isnull().sum()

Age     0
Fare    0
dtype: int64

In [19]:
# Embarked değişkeni kategorik olduğu için mode ile dolduralım.
# burada ise fillna metodunu kullanacağız

df_titanic["Embarked"] = df_titanic.fillna(df_titanic["Embarked"].mode()[0])

df_titanic["Embarked"].isnull().sum()

0

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [96]:
print("Dağılıma baktığımızda SibSp değerininin yüzde 67 den fazlası 0 değerini almış. Bu yüzden null olan\n"+
     " değerleri ortalama ile doldurmaya karar verdim. DataFrame'in bir kopyasını alıp önceki istatistikleri \n"+
     " ile karşılaştırma yapacağım.")

df_titanic_3 = df_titanic.copy()

Dağılıma baktığımızda SibSp değerininin yüzde 67 den fazlası 0 değerini almış. Bu yüzden null olan
 değerleri ortalama ile doldurmaya karar verdim. DataFrame'in bir kopyasını alıp önceki istatistikleri
 ile karşılaştırma yapacağım.

In [97]:
df_titanic_3["SibSp"].describe()

count    721.000000
mean       0.535368
std        1.140996
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

In [98]:
df_titanic_3.SibSp.value_counts()

0.0    489
1.0    173
2.0     21
4.0     16
3.0     12
8.0      7
5.0      3
Name: SibSp, dtype: int64

In [99]:
df_titanic_3["SibSp"] = df_titanic_3["SibSp"].fillna(df_titanic_3.SibSp.mean())
df_titanic_3.SibSp.isnull().sum()

0

In [102]:
# data'nın mean ile dolu hali ve önceki hali
df_titanic_3.SibSp.describe(), df_titanic.SibSp.describe()

(count    891.000000
 mean       0.535368
 std        1.026255
 min        0.000000
 25%        0.000000
 50%        0.000000
 75%        1.000000
 max        8.000000
 Name: SibSp, dtype: float64,
 count    721.000000
 mean       0.535368
 std        1.140996
 min        0.000000
 25%        0.000000
 50%        0.000000
 75%        1.000000
 max        8.000000
 Name: SibSp, dtype: float64)

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [103]:
new_titanic =  pd.read_csv("train_missing.csv")
new_titanic.Embarked = new_titanic["Embarked"].fillna("NAN")

In [104]:
new_titanic.Embarked.value_counts()

S      529
NAN    173
C      128
Q       61
Name: Embarked, dtype: int64

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [123]:
new_titanic2 = pd.read_csv("train_missing.csv")
na_indices = new_titanic2.Fare[new_titanic2.Fare.isnull()].index.to_list()

In [124]:
new_titanic2.insert(9,"Fare_Missing",0)
new_titanic2.loc[na_indices, "Fare_Missing"] = 1

In [125]:
new_titanic2.Fare.fillna(new_titanic2.Fare.median(),inplace = True)

In [128]:
display(new_titanic2.head(12))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare_Missing,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,0,7.25000,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,0,71.28330,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,0,7.92500,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,0,53.10000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,0,8.05000,NaN,NaN
5,6,0,3,"Moran, Mr. James",male,NaN,0.0,0,330877,0,8.45830,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0.0,0,17463,0,51.86250,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,NaN,1,349909,0,21.07500,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,NaN,2,347742,0,11.13330,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0,237736,0,30.07080,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1.0,1,PP 9549,0,16.70000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0.0,0,113783,1,14.45625,C103,S